def area(a, h):
    '''
    Возвращает площадь треугольника.

    Параметры:
        a (float): длина основания
        b (float): высота треугольник

    Возвращаемое значение:
        float: площадь треугольника
    '''

def perimetr(a, b, c):
    '''

    Возвращает периметр треугольника.

    Параметры:
        a (float): длина первой стороны
        b (float): длина второй стороны
        c (float): длина третьей стороны


    Возвращаемое значние:
        float: периметр треугольника
    '''

    return a + b + c
